# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

In [2]:
url ='https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv'

### Step 3. Assign it to a variable called baby_names.

In [3]:
baby_names = pd.read_csv(url)

### Step 4. See the first 10 entries

In [4]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [5]:
baby_names.drop(['Unnamed: 0', 'Id'], axis=1, inplace=True)
baby_names.head(10)

       Name  Year Gender State  Count
0      Emma  2004      F    AK     62
1   Madison  2004      F    AK     48
2    Hannah  2004      F    AK     46
3     Grace  2004      F    AK     44
4     Emily  2004      F    AK     41
5   Abigail  2004      F    AK     37
6    Olivia  2004      F    AK     33
7  Isabella  2004      F    AK     30
8    Alyssa  2004      F    AK     29
9    Sophia  2004      F    AK     28

### Step 6. What year has the highest number of baby names in the dataset?

In [15]:
baby_names.groupby('Year')['Count'].count().sort_values(ascending=False).head(1)

Year
2008    94970
Name: Count, dtype: int64

### Step 7. Is there more male or female names in the dataset?

In [19]:
baby_names['Gender'].value_counts()

Gender
F    558846
M    457549
Name: count, dtype: int64

### Step 8. Group the dataset by name and assign to names

In [24]:
names = baby_names.groupby('Name')

### Step 9. How many different names exist in the dataset?

In [28]:
baby_names['Name'].nunique()

17632

### Step 10. What is the name with most occurrences?

In [30]:
baby_names['Name'].value_counts().head(1)

Name
Riley    1112
Name: count, dtype: int64

### Step 11. How many different names have the least occurrences?

In [82]:
name_counts = baby_names['Name'].value_counts()
min_counts = name_counts.min()
name_counts[name_counts==min_counts].count()

np.int64(3682)

### Step 12. What is the median name occurrence?

In [90]:
baby_names['Count'].median()

np.float64(11.0)

### Step 13. What is the standard deviation of names?

In [103]:
name_counts = baby_names['Name'].value_counts()
name_counts.std()

np.float64(122.0299635081389)

### Step 14. Get a summary with the mean, min, max, std and quartiles.

In [102]:
baby_names['Count'].agg(['mean', 'min', 'max', 'std'])

mean      34.850124
min        5.000000
max     4167.000000
std       97.397346
Name: Count, dtype: float64